clear all
clc

%x = [ 20, 40, 50, 60, 80, 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]; %横坐标，迭代次数

x=[0,5,10,15,20,25,30,35];

IMPN_runtime=[1.274,2.961,10.327,59.420,197.439,290.903,1391.415,11296.066];
AIMPN_runtime=[21.110,83.169,336.404,2172.766,5510.201,8505.129,32842.004,204281.991];
BPIMPN_runtime=[20.800,77.989,328.788,1928.253,5287.167,8119.437,30901.765,193198.802];
GAANN_runtime=[337.13,1122.165,4487.723,27149.19,61398.957,95475.493,336214.157,1083704.226];

graph1=plot(x,IMPN_runtime,'-* b', x,AIMPN_runtime,'-V g', x,BPIMPN_runtime,'-s r', x,GAANN_runtime, '-o ')

set(graph1,'LineWidth',1);
set(gca,'xticklabel',[5,10,20,50,80,100,200,500])
axis( [0,35,0,1083705] );

xlabel('数据规模(千)');%横坐标名字
ylabel('运行时间(单位:秒)');%纵坐标名字
%title('The graph of average run time ');
legend('OMPN','A-OMPN','BP-OMPN','GA-ANN');%图例
