clear all
clc

%x = [ 20, 40, 50, 60, 80, 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]; %横坐标，迭代次数

x=[5,10,20,50,80,100,200,500];%横坐标


IMPN_runtime=[1.274,2.961,10.327,59.420,197.439,290.903,1391.415,11296.066];
IIMPN_runtime=[21.110,83.169,336.404,2172.766,5510.201,8505.129,32842.004,204281.991];
plot(x,IMPN_runtime,'-s r',x,IIMPN_runtime,'-* b')%画图命令
axis( [0,500,0,404281] );%横纵坐标的坐标取值范围
xlabel('数据规模(千)');%横坐标名字
ylabel('运行时间(单位:秒)');%纵坐标名字
%title('The graph of average run time ');
legend('IMPN','改进的IMPN');%图例
